Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetDemandLoadCalculationDetailsData(Autodesk.Revit.DB.ElementId)
This function is used to get AnalyticalDemandLoadCalculationDetailsData by given Load Scenario.
The returned temporary data provides detailed information of the current demand load calculation results of the node. Whenever you modify any parameters, the data will not
be automatically updated. You need to use this API to get another new data.
The given load scenario id can be invalidElementId if you don't need to take load scenario into consideration.
loadScenarioId:
Load Scenario id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical analytical load scenario.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetLoadClassificationIds
Get all the Load Classification ids which collected from all the Electrical Analytical Loads in current node.

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetLoadClassificationDemandCurrent(Autodesk.Revit.DB.ElementId)
Get the demand current of given load classification.
loadClassificationId:
The load classification id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetLoadClassificationDemandLoad(Autodesk.Revit.DB.ElementId)
Get the demand load of given load classification.
loadClassificationId:
The load classification id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetLoadClassificationTotalCurrent(Autodesk.Revit.DB.ElementId)
Get the total current of given load classification.
loadClassificationId:
The load classification id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.GetLoadClassificationTotalLoad(Autodesk.Revit.DB.ElementId)
Get the total load of given load classification.
loadClassificationId:
The load classification id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.ContainLoadClassification(Autodesk.Revit.DB.ElementId)
Check whether load classification contains.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.AnalyticalLoadClassificationData
Represents the electrical analytical load classification data.